<?php

/**
 * 后台管理起点
 * 
 */

require(dirname(__FILE__) . '/includes/init.php');


/*------------------------------------------------------ */
//-- 框架
/*------------------------------------------------------ */
if ($_REQUEST['do'] == '')
{
	$smarty->assign('hello','hello world');
    $smarty->display('index.tpl');
}

/*------------------------------------------------------ */
//-- 顶部框架的内容
/*------------------------------------------------------ */
elseif ($_REQUEST['do'] == 'top')
{
	$nav_list = array();
	$nav_list['/items.php?do=list'] = '商品列表';
	$smarty->assign('nav_list', $nav_list);
	$smarty->display('top.tpl');
}


/*------------------------------------------------------ */
//-- 左边的框架
/*------------------------------------------------------ */
elseif ($_REQUEST['do'] == 'menu')
{
	$smarty->display('menu.tpl');
}


/*------------------------------------------------------ */
//-- 主窗口，起始页
/*------------------------------------------------------ */
elseif ($_REQUEST['do'] == 'main')
{
	
	$smarty->display('items_list.tpl');
}

/*------------------------------------------------------ */
//-- 拖动的帧
/*------------------------------------------------------ */

elseif ($_REQUEST['do'] == 'drag')
{
    $smarty->display('drag.tpl');;
}

?>
